import { test, expect } from "@playwright/test" // імпортували функцію тест

test("testName1", async ({page}) => {        // передали назву тесту і функцію кол бек
    await page.goto("https://google.com");    // у функцію передали фікстуру пейдж яка дає інструмент для тестування, зокрема метод готу, який забезпечив 
    // перехід на ресурс і використання конструкції асинк - евейт для асинхроного функціоналу
    // метод го ту він вертає проміс тому не можем юзати без аснхнронного оформлення
});


// твердження - ASSERTIONS і типи assertions 
// чи поводиться додаток згідно з нашими очікуваннями
// ми створюєм ассершини за допомогою функції expect()


//expect(actual).matcherMethod(expected);
//щоб їх зіставити використовують matcher methods - їх є багато


test("testName2", async ({page}) => {   
    await page.goto("https://google.com");
    await expect(page).toHaveTitle(/Google/);  // регулярка, яка означає: знайди "Google" у будь-якому місці заголовка.
});
